
def n():

    a_dict = {"Австрия": "Вена", "Бельгия": "Брюссель", "Великобритания": "Лондон", "Германия": "Берлин", "Ирландия": "Дублин", "Лихтенштейн": "Вадуц", "Нидерладны": "Амстердам",
                 "Франция": "Париж", "Белоруссия": "Минск", "Болгария": "София", "Польша": "Варшава", "Чехия": "Прага", "Албания": "Тирана", "Босния и Герцеговина": "Сараево",
                 "Северная Македония": "Скопье", "Сербия": "Белград"}
    print(a_dict)
    print(a_dict["Бельгия"])
    for key in sorted(a_dict):
        print(key, "-",a_dict[key])

def n1():
    a = {
        "авеинорст": 1,
        "дклмпу": 2,
        "бгёья": 3,
        "йы": 4,
        "жзхцч": 5,
        "шэю": 8,
        "фщъ": 10
    }
    s = 0
    w = input()

    for i in w:
        for key, value in a.items():
            if i in key:
                s += value
    print(s)

def n2():
    s = {"Аузяк": "Екатерина", "Беликова": "Нелли",
          "Ефлютина": "Ирина", "Гумерова": "Эвелина"}
    l = {
            "Аузяк": ["Английский", "Русский"],
            "Беликова": ["Английский", "Русский", "Корейский"]
            "Ефлютина": ["Русский", "Японский"],
            "Гумерова": ["Русский"], }
    a = {}
    b = {}
    for key in l:
        if l(l[key]) > 1:
            a[key] = s[key]
            for i in l[key]:
                if i == "Китайский":
                    b[key] = s[key]
    print("> 1")
    for key in a:
        print(key, a[key])
    print("Знают китайский")
    for key in b:
        print(key, b[key])

